Catalogs/ТоварныеГруппыГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТоварныеГруппыГИСМТ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСканированияКодаМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТоварныеГруппыГИСМТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для выбора товарных групп с отбором по элементу конструктора видов продукции.
//
// Параметры:
//   Первые - Число - количество выбираемых записей (0 - без ограничений)
//   ИмяВременнойТаблицы - Строка - имя временной таблицы для помещения результата запроса (пустая строка - без помещения)
//
// Возвращаемое значение:
//   Строка - текст запроса для выборки товарных групп
Функция ТекстЗапросаТоварныхГруппСОтборомПоЭлементуКонструктора(Первые = 0, ИмяВременнойТаблицы = "") Экспорт
	
	Если Первые > 0 Тогда
		ОтборПервые = СтрШаблон("ПЕРВЫЕ %1", Формат(Первые, "ЧРГ=; ЧГ=;"));
	Иначе
		ОтборПервые = "";
	КонецЕсли;
	
	Если ИмяВременнойТаблицы = "" Тогда
		ТекстПоместить = "";
	Иначе
		ТекстПоместить = СтрШаблон("ПОМЕСТИТЬ %1", ИмяВременнойТаблицы);
	КонецЕсли;
	
	Возврат СтрШаблон(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ %1 ТоварныеГруппы.*
	|%3
	|ИЗ Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
	|			ЗначенияЭлементовКонструктора.Значение КАК ТоварнаяГруппа
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|			ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ)
	|			И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции,
	|			ЗначенияПользователяЭлементовКонструктора.Значение
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ЗначенияТоварныеГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции
	|			ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|				ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|				И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|			ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора В (&ЭлементКонструктораДляОпределенияДоступныхВидовПродукции)
	|				И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|			ОБЪЕДИНИТЬ
	|			ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|			ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|			ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора В (&ЭлементКонструктораДляОпределенияДоступныхВидовПродукции)
	|				И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|			) КАК ЗначенияВидыПродукции
	|		ПО ЗначенияТоварныеГруппы.ВидПродукции = ЗначенияВидыПродукции.ВидПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			(%2) КАК ЗначенияДоступныеВидыПродукции
	|		ПО ЗначенияТоварныеГруппы.ВидПродукции = ЗначенияДоступныеВидыПродукции.ВидПродукции
	|	ПО ТоварныеГруппы.Ссылка = ЗначенияТоварныеГруппы.ТоварнаяГруппа",
	ОтборПервые,
	Справочники.ВидыПродукцииИС.ТекстЗапросаСОтборомПоПодсистеме("ГИСМТ"),
	ТекстПоместить);
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Идентификатор");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭлементКонструктора") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭлементКонструктораДляОпределенияДоступныхВидовПродукции", Параметры.ЭлементКонструктора);
		Запрос.УстановитьПараметр("СтрокаПоиска", "%"+Параметры.СтрокаПоиска+"%");
		Запрос.Текст =
		ТекстЗапросаТоварныхГруппСОтборомПоЭлементуКонструктора(50) + "
		|ГДЕ
		|	ТоварныеГруппы.Наименование ПОДОБНО &СтрокаПоиска";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Выборка.Ссылка;
			Элемент.Представление = Выборка.Наименование;
			Элемент.Пометка = Выборка.ПометкаУдаления;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.ТоварныеГруппыГИСМТ.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьТоварныеГруппыГИСМТИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьТоварныеГруппыГИСМТИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки)

	Идентификаторы          = ПараметрыЗагрузки.Идентификаторы;
	ДанныеПоТоварнымГруппам = ДанныеКлассификатора.ТоварныеГруппыГИСМТ;
	ИмяТаблицы              = Метаданные.Справочники.ТоварныеГруппыГИСМТ.ПолноеИмя();
	КонфликтыОбновления     = ПараметрыЗагрузки.КонфликтыОбновления;
	
	ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Наименование",               ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор",              ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеДляПодбора.Колонки.Добавить("Код",                        ОбщегоНазначения.ОписаниеТипаСтрока(4));
	ДанныеДляПодбора.Колонки.Добавить("Имя",                        ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ДанныеДляПодбора.Колонки.Добавить("Статус",                     ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("ХешСуммаПоставляемыхДанных", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеДляПодбора.Колонки.Добавить("Модифицирован",              Новый ОписаниеТипов("Булево"));
	
	Для каждого СтрокаКЗагрузке из ДанныеПоТоварнымГруппам Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляПодбора.Добавить(), СтрокаКЗагрузке);
		ЕстьСвойствоМодифицирован = СтрокаКЗагрузке.Свойство("Модифицирован");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Наименование КАК Наименование,
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ДанныеДляПодбора.Код КАК Код,
		|	ДанныеДляПодбора.Имя КАК Имя,
		|	ДанныеДляПодбора.Статус КАК Статус,
		|	ДанныеДляПодбора.ХешСуммаПоставляемыхДанных КАК ХешСуммаЗагружаемыхДанных,
		|	ДанныеДляПодбора.Модифицирован КАК Модифицирован
		|
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Код КАК Код,
		|	втДанныеДляПодбора.Имя КАК Имя,
		|	втДанныеДляПодбора.Модифицирован КАК Модифицирован,
		|	ТоварныеГруппыГИСМТ.Ссылка КАК СсылкаПоИдентификатору,
		|	ТоварныеГруппыГИСМТ.ХешСумма КАК ХешСумма,
		|	ТоварныеГруппыГИСМТ.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
		|		ПО втДанныеДляПодбора.Идентификатор = ТоварныеГруппыГИСМТ.Идентификатор
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Код КАК Код,
		|	втДанныеДляПодбора.Имя КАК Имя,
		|	втДанныеДляПодбора.Статус КАК Статус,
		|	втДанныеДляПодбора.ХешСуммаЗагружаемыхДанных КАК ХешСуммаЗагружаемыхДанных,
		|	втДанныеДляПодбора.Модифицирован КАК Модифицирован,
		|	ТоварныеГруппыГИСМТ.Ссылка КАК СсылкаПоКлючевымПолям,
		|	ТоварныеГруппыГИСМТ.ХешСумма КАК ХешСумма,
		|	ТоварныеГруппыГИСМТ.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
		|		ПО втДанныеДляПодбора.Имя = ТоварныеГруппыГИСМТ.Имя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	втРезультатыПодбораПоКлючевымПолям.Наименование КАК Наименование,
		|	втРезультатыПодбораПоКлючевымПолям.Имя КАК Имя,
		|	втРезультатыПодбораПоКлючевымПолям.Код КАК Код,
		|	втРезультатыПодбораПоКлючевымПолям.Статус,
		|	втРезультатыПодбораПоКлючевымПолям.ХешСуммаЗагружаемыхДанных,
		|	втРезультатыПодбораПоКлючевымПолям.Модифицирован,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Имя = втРезультатыПодбораПоИдентификатору.Имя
		|		И втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
		СтрокаИдентификатора.Наименование  = ВыборкаДетальныеЗаписи.Имя;
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И ЕстьСвойствоМодифицирован Тогда
			Если Не ВыборкаДетальныеЗаписи.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка, ВыборкаДетальныеЗаписи.ХешСумма,
			ВыборкаДетальныеЗаписи.ХешСуммаПоставляемыхДанных, ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных);
		
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				ИмяТаблицы, ВыборкаДетальныеЗаписи.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;
		
		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;
		КонецЕсли;
		
		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;
			СтруктураЗагружаемыхДанных  = ИнициализироватьПараметрыОбновления();

			ЗаполнитьЗначенияСвойств(СтруктураЗагружаемыхДанных, ВыборкаДетальныеЗаписи, , "ХешСуммаПоставляемыхДанных");

			СтруктураЗагружаемыхДанных.ХешСуммаПоставляемыхДанных = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;
			
			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка, СтруктураЗагружаемыхДанных);

		КонецЕсли;			
		
		Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, ВыборкаДетальныеЗаписи, , "Идентификатор,ХешСуммаПоставляемыхДанных");

			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
			КонецЕсли;

			Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				ВыборкаДетальныеЗаписи.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[ВыборкаДетальныеЗаписи.Статус];
			КонецЕсли;
			
			СуществующийОбъект.ХешСумма = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;
            
         	Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
				СуществующийОбъект.ХешСуммаПоставляемыхДанных = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;	
         	КонецЕсли;
         	
         	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);
			
			СтрокаИдентификатора.Ссылка = СуществующийОбъект.Ссылка;

		КонецЕсли;
		
	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		ИдентификаторыПоТипу = Идентификаторы.Скопировать(Новый Структура("ИмяТаблицы", ИмяТаблицы), "Наименование,Идентификатор");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИдентификаторов.Наименование КАК Наименование,
		|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВтИдентификаторы
		|ИЗ
		|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварныеГруппыГИСМТ.Ссылка КАК Ссылка,
		|	ТоварныеГруппыГИСМТ.Идентификатор КАК Идентификатор,
		|	ТоварныеГруппыГИСМТ.Имя КАК Наименование
		|ИЗ
		|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИдентификаторы КАК ВтИдентификаторы
		|		ПО ТоварныеГруппыГИСМТ.Идентификатор = ВтИдентификаторы.Идентификатор
		|			И ТоварныеГруппыГИСМТ.Имя = ВтИдентификаторы.Наименование
		|ГДЕ
		|	ВтИдентификаторы.Наименование ЕСТЬ NULL
		|	И ВтИдентификаторы.Идентификатор ЕСТЬ NULL";
		Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ИдентификаторыПоТипу);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаИдентификатора = Идентификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, ВыборкаДетальныеЗаписи);
			
			СтрокаИдентификатора.ИмяТаблицы = ИмяТаблицы;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",               "");
	СтруктураДанныхОбновления.Вставить("Код",                        0);
	СтруктураДанныхОбновления.Вставить("Имя",                        "");
	СтруктураДанныхОбновления.Вставить("Идентификатор",              "");
	СтруктураДанныхОбновления.Вставить("Статус",                     "");
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных", "");

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
